case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          2672;
        startFace       601098;
    }
    inlet
    {
        type            patch;
        nFaces          2672;
        startFace       603770;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          11812;
        startFace       606442;
    }
    rotor_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          35291;
        startFace       618254;
    }
    defaultFaces
    {
        type            patch;
        nFaces          0;
        startFace       653545;
    }
)

// ************************************************************************* //
